pipeTestVi/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:                                        |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          160;
        startFace       6280;
    }
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       6440;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       6480;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          6400;
        startFace       6520;
    }
)

// ************************************************************************* //
